/*
Задание 2:
1. Создайте переменную `num` и присвойте ей значение `123`. Выведите значение этой переменной в консоль.
2. Создайте переменную `а` и присвойте ей значение `5`, переопределите переменную `а` на значение `7`, выведите переменную `а` в консоль.
3. Создайте переменную `b`. Запишите в нее сумму чисел `1`, `2` и `3`. С помощью функции `console.log` выведите в консоль содержимое переменной `b`.
4. Создайте два вида комментариев в вашем коде, добавьте в них произвольный текст.
Тайминг: 20 минут.
*/

// 1. Создайте переменную `num` и присвойте ей значение `123`.
// Выведите значение этой переменной в консоль.

const num = 123;
console.log(num);

// 2. Создайте переменную `а` и присвойте ей значение `5`, переопределите переменную `а` на значение `7`, выведите переменную `а` в консоль.

let a = 5;
console.log('a >>> ', a);
a = 7;
console.log('a >>> ', a);

// Создайте переменную `b`. Запишите в нее сумму чисел `1`, `2` и `3`. С помощью функции `console.log` выведите в консоль содержимое переменной `b`.

const b = 1 + 2 + 3;
console.log('b >>> ', b);
